# Даны четыре действительных числа: x1, y1, x2, y2. Напишите функцию distance(x1, y1, x2, y2),
# вычисляющую расстояние между точкой (x1,y1) и (x2,y2). Считайте четыре действительных числа
# и выведите результат работы этой функции.
#
# Входные данные
# Вводятся четыре действительных числа.
#
# Выходные данные
# Выведите ответ на задачу.
def distance(x1, y1, x2, y2):
    return ((x1 - x2) ** 2 + (y1 - y2) ** 2) ** 0.5


x1 = float(input())
x2 = float(input())
y1 = float(input())
y2 = float(input())
print(distance(x1, x2, y1, y2))