# Дана строка. Получите новую строку, вставив между двумя символами исходной строки символ *.
# Выведите полученную строку.
#
# Входные данные
# Вводится строка.
#
# Выходные данные
# Выведите ответ на задачу.
print(*list(input()), sep='*')
