# Входные данные
# Даны два целых числа, каждое число записано в отдельной строке.
#
# Выходные данные
# Выведите наибольшее из данных чисел.
print(max(int(input()), int(input())))
