# Петя перешёл в другую школу. На уроке физкультуры ему понадобилось определить своё место в строю.
# Помогите ему это сделать.
#
# Входные данные
# Программа получает на вход невозрастающую последовательность натуральных чисел, означающих рост каждого человека в
# строю. После этого вводится число X – рост Пети. Все числа во входных данных натуральные и не превышают 200.
#
# Выходные данные
# Выведите номер, под которым Петя должен встать в строй. Если в строю есть люди с одинаковым ростом, таким же,
# как у Пети, то он должен встать после них.
a = [int(i) for i in input().split()]
x = int(input())
s = 0
while s < len(a) and a[s] >= x:
    s += 1
print(s + 1)